In [11]:
import pandas as pd
import numpy as np

In [12]:
df=pd.DataFrame({
    "degisken1":[10,23,33,22,11,99],
    "degisken2":[100,253,333,262,111,969]
},
columns=["degisken1","degisken2"])

df

   degisken1  degisken2
0         10        100
1         23        253
2         33        333
3         22        262
4         11        111
5         99        969

- apply fonksiyonu, tıpkı transform ve filter gibi DataFrame'in değişkenlerinin üzerinde gezinme yeteneği olan ve aggeration yani toplulaştırma amacıyla kullanılabilecek olan bir fonksiyondur.

In [13]:
# sütun bazında degisken1'in değerlerini/gözlemlerini topladı
# sütun bazında degisken2'in değerlerini/gözlemlerini topladı
df.apply(np.sum)

degisken1     198
degisken2    2028
dtype: int64

In [14]:
df.apply(np.mean)

degisken1     33.0
degisken2    338.0
dtype: float64

### Peki Gruplar Olsaydı?

In [15]:
df=pd.DataFrame({
    "degisken1":[10,23,33,22,11,99],
    "degisken2":[100,253,333,262,111,969],
    "gruplar":["A","B","C","A","B","C"]
})

df

   degisken1  degisken2 gruplar
0         10        100       A
1         23        253       B
2         33        333       C
3         22        262       A
4         11        111       B
5         99        969       C

In [16]:
df=pd.DataFrame({
    "degisken1":[10,23,33,22,11,99],
    "degisken2":[100,253,333,262,111,969],
    "gruplar":["A","B","C","A","B","C"]
},
columns=["gruplar","degisken1","degisken2"])

df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [17]:
# grup bazında yapalım
df.groupby("gruplar").apply(np.sum)

        gruplar  degisken1  degisken2
gruplar
A            AA         32        362
B            BB         34        364
C            CC        132       1302

In [18]:
# grup bazında yapalım
df.groupby("gruplar").apply(np.mean)

/opt/anaconda3/lib/python3.9/site-packages/numpy/core/fromnumeric.py:3417: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)

         degisken1  degisken2
gruplar
A             16.0      181.0
B             17.0      182.0
C             66.0      651.0